In [3]:
# Pandas - Exploratory Data Analysis (EDA)
# a powerful data analysis and manipulation library for Python
import pandas as pd

In [48]:
# Series
# This means that a DataFrame can store more complex and heterogeneous data, 
# while a Series can store more simple and homogeneous data. Another difference is that a DataFrame
# can have different data types for each column, while a Series can only have one data type for the whole array.
l1 = [[4,7,9],[1,2,3]]
var = pd.Series(l1)
var

0    [4, 7, 9]
1    [1, 2, 3]
dtype: object

In [43]:
# Data Frame Creation
dict = {'Name':['Ranjith','Siyan','Ram'],'Loc':['Tamil Nadu','Kerala','UP']}
df1 = pd.DataFrame(dict)
df1

      Name         Loc
0  Ranjith  Tamil Nadu
1    Siyan      Kerala
2      Ram          UP

In [35]:
# Data Frame
df = pd.read_csv(r"C:\Users\User\Python\foods.csv")
df.head()

  First Name  Gender          City Frequency       Item  Spend
0      Wanda  Female      Stamford    Weekly     Burger  15.66
1       Eric    Male      Stamford     Daily    Chalupa  10.56
2    Charles    Male      New York     Never      Sushi  42.14
3       Anna  Female  Philadelphia      Once  Ice Cream  11.01
4    Deborah  Female  Philadelphia     Daily    Chalupa  23.49

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  1000 non-null   object
 1   Gender      1000 non-null   object
 2   City        1000 non-null   object
 3   Frequency   1000 non-null   object
 4   Item        1000 non-null   object
 5   Spend       1000 non-null   float64
dtypes: float64(1), object(5)
memory usage: 47.0+ KB

In [19]:
df.describe()

             Spend
count  1000.000000
mean     50.069370
std      27.728471
min       1.020000
25%      27.380000
50%      48.825000
75%      73.092500
max      99.870000

In [24]:
df['Gender'].value_counts(normalize=True)*100

Gender
Female    51.2
Male      48.8
Name: proportion, dtype: float64

In [31]:
for i in range(len(df.columns)):
    print(df.columns[i])

First Name
Gender
City
Frequency
Item
Spend

In [32]:
df['City'].value_counts(normalize=True)*100

City
Philadelphia    35.9
Stamford        32.8
New York        31.3
Name: proportion, dtype: float64

In [33]:
df['Frequency'].value_counts(normalize=True)*100

Frequency
Weekly     14.5
Daily      13.7
Once       13.2
Yearly     12.6
Often      12.5
Never      12.0
Monthly    11.1
Seldom     10.4
Name: proportion, dtype: float64

In [34]:
df['Item'].value_counts(normalize=True)*100

Item
Donut        18.7
Ice Cream    17.6
Burrito      16.8
Sushi        16.6
Burger       15.6
Chalupa      14.7
Name: proportion, dtype: float64

In [53]:
df[['First Name','Item']].head(10)

  First Name       Item
0      Wanda     Burger
1       Eric    Chalupa
2    Charles      Sushi
3       Anna  Ice Cream
4    Deborah    Chalupa
5    Charles      Sushi
6       Mark  Ice Cream
7       Paul    Chalupa
8      Larry     Burger
9      Roger    Chalupa